bench/results/server1/1/scotty-0.8.2/DEEP.log
Benchmarking DEEP
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   322.74ms    1.06s    7.85s    97.28%
    Req/Sec   347.55    187.89     1.10k    60.35%
  75040 requests in 30.00s, 10.59MB read
  Socket errors: connect 0, read 0, write 0, timeout 241
Requests/sec:   2501.09
Transfer/sec:    361.49KB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   391.54ms  424.34ms   6.12s    73.01%
    Req/Sec   376.64    311.34     1.19k    52.28%
  74812 requests in 30.01s, 10.56MB read
  Socket errors: connect 0, read 0, write 0, timeout 346
Requests/sec:   2493.01
Transfer/sec:    360.32KB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   424.47ms  425.78ms   5.21s    68.06%
    Req/Sec   375.27    338.78     1.25k    48.00%
  74802 requests in 30.01s, 10.56MB read
  Socket errors: connect 0, read 0, write 0, timeout 267
Requests/sec:   2492.90
Transfer/sec:    360.30KB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   433.74ms  441.20ms   7.48s    68.41%
    Req/Sec   373.60    331.35     1.28k    48.92%
  74827 requests in 30.00s, 10.56MB read
  Socket errors: connect 0, read 0, write 0, timeout 244
Requests/sec:   2493.92
Transfer/sec:    360.45KB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   405.83ms  428.82ms   8.47s    70.65%
    Req/Sec   383.14    324.86     1.21k    49.91%
  74729 requests in 30.01s, 10.55MB read
  Socket errors: connect 0, read 9, write 0, timeout 309
Requests/sec:   2490.43
Transfer/sec:    359.94KB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   320.80ms  347.87ms   2.78s    78.62%
    Req/Sec   371.93    279.74     1.19k    60.48%
  74701 requests in 30.01s, 10.54MB read
  Socket errors: connect 0, read 0, write 0, timeout 253
Requests/sec:   2489.24
Transfer/sec:    359.77KB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   423.78ms  435.76ms   2.11s    70.24%
    Req/Sec   372.48    320.11     1.22k    49.73%
  74662 requests in 30.01s, 10.54MB read
  Socket errors: connect 0, read 0, write 0, timeout 260
Requests/sec:   2488.05
Transfer/sec:    359.60KB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   302.08ms  266.27ms   2.76s    72.23%
    Req/Sec   371.76    313.30     1.38k    51.01%
  74740 requests in 30.01s, 10.55MB read
  Socket errors: connect 0, read 0, write 0, timeout 282
Requests/sec:   2490.76
Transfer/sec:    359.99KB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   406.49ms  427.51ms   1.43s    71.54%
    Req/Sec   379.20    315.72     1.23k    50.29%
  74903 requests in 30.01s, 10.57MB read
  Socket errors: connect 0, read 0, write 0, timeout 271
Requests/sec:   2495.99
Transfer/sec:    360.75KB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   414.05ms  422.71ms   7.79s    69.77%
    Req/Sec   374.65    323.54     1.26k    48.87%
  74652 requests in 30.01s, 10.54MB read
  Socket errors: connect 0, read 0, write 0, timeout 254
Requests/sec:   2487.86
Transfer/sec:    359.57KB
=================== summary ===================
ghc version:  7.8.2
bench target: scotty-0.8.2
bench:        DEEP
bench mode:   30s * 10
average:      2492.32
stdev:        4.05
=================== oneline ===================
7.8.2,scotty-0.8.2,DEEP,30s,10,2492.32,4.05