bench/results/server1/1/scotty-0.8.2/PARAM.log
Benchmarking PARAM
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    25.37ms   42.05ms 707.06ms   99.59%
    Req/Sec     2.23k   548.58     5.37k    79.14%
  515972 requests in 30.01s, 100.38MB read
  Socket errors: connect 0, read 0, write 0, timeout 68
Requests/sec:  17194.92
Transfer/sec:      3.35MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    23.39ms   17.45ms 994.48ms   99.67%
    Req/Sec     2.18k   473.27     4.86k    76.16%
  512735 requests in 30.00s, 99.75MB read
  Socket errors: connect 0, read 0, write 0, timeout 9
Requests/sec:  17089.38
Transfer/sec:      3.32MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    22.59ms   10.09ms 744.61ms   97.76%
    Req/Sec     2.25k   620.23     6.88k    81.48%
  516743 requests in 30.01s, 100.53MB read
  Socket errors: connect 0, read 0, write 0, timeout 118
Requests/sec:  17221.63
Transfer/sec:      3.35MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    38.20ms  104.45ms 769.87ms   97.65%
    Req/Sec     2.21k   703.92     6.68k    78.67%
  514325 requests in 30.00s, 100.06MB read
  Socket errors: connect 0, read 0, write 0, timeout 121
Requests/sec:  17142.47
Transfer/sec:      3.34MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    23.43ms   11.62ms   1.11s    98.05%
    Req/Sec     2.23k   496.43     6.16k    85.78%
  512505 requests in 30.00s, 99.71MB read
Requests/sec:  17081.41
Transfer/sec:      3.32MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    29.97ms   78.62ms 992.55ms   99.08%
    Req/Sec     2.23k   784.60     7.24k    78.95%
  515627 requests in 30.00s, 100.32MB read
  Socket errors: connect 0, read 0, write 0, timeout 29
Requests/sec:  17185.14
Transfer/sec:      3.34MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    30.13ms   80.66ms   1.12s    98.96%
    Req/Sec     2.22k   673.81     6.76k    79.98%
  513039 requests in 30.00s, 99.81MB read
  Socket errors: connect 0, read 0, write 0, timeout 15
Requests/sec:  17102.31
Transfer/sec:      3.33MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    26.48ms   55.95ms 984.94ms   99.58%
    Req/Sec     2.23k   494.01     5.95k    80.55%
  517007 requests in 30.00s, 100.58MB read
  Socket errors: connect 0, read 0, write 0, timeout 5
Requests/sec:  17232.34
Transfer/sec:      3.35MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    23.92ms   23.15ms 728.25ms   99.74%
    Req/Sec     2.20k   395.68     5.13k    85.37%
  513085 requests in 30.00s, 99.82MB read
  Socket errors: connect 0, read 0, write 0, timeout 26
Requests/sec:  17101.39
Transfer/sec:      3.33MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    22.99ms    6.69ms 876.87ms   97.39%
    Req/Sec     2.20k   450.72     3.64k    71.11%
  516475 requests in 30.00s, 100.48MB read
Requests/sec:  17214.96
Transfer/sec:      3.35MB
=================== summary ===================
ghc version:  7.8.2
bench target: scotty-0.8.2
bench:        PARAM
bench mode:   30s * 10
average:      17156.59
stdev:        59.65
=================== oneline ===================
7.8.2,scotty-0.8.2,PARAM,30s,10,17156.59,59.65